InformationRegisters/НевалидныеСимволыСлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>НевалидныеСимволыСлов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Символ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Произведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Произведения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Связь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Произведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Авторы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсказка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>45</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коммент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Визуализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Картинки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Тело</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>45</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОбщегоНазначенияСервер/Ext/Module.bsl
Функция ПолучитьСлучайноеЧисло(числоОт, числоДо) Экспорт

	НачальноеЧисло 	= числоОт;
	ГСЧ 			= Новый ГенераторСлучайныхЧисел(НачальноеЧисло);
	СлучайноеЧисло 	= ГСЧ.СлучайноеЧисло(числоОт, числоДо);
	
	Возврат СлучайноеЧисло;

КонецФункции // ПолучитьСлучайноеЧисло()

Функция ПолучитьСтруктуруСправочникаПроизведения() Экспорт

	ДанныеСтруктура = Новый Структура;
	
	ДанныеСтруктура.Вставить("Description", 		"");
	ДанныеСтруктура.Вставить("DeletionMark", 		Ложь);
	ДанныеСтруктура.Вставить("Связь", 				Справочники.Произведения.ПустаяСсылка());
	ДанныеСтруктура.Вставить("Дата",				'00010101');
	ДанныеСтруктура.Вставить("_Автор",				"");
	ДанныеСтруктура.Вставить("Подсказка",			"");
	ДанныеСтруктура.Вставить("Коммент",				"");
	ДанныеСтруктура.Вставить("СодержитКартинку", 	Ложь);
	ДанныеСтруктура.Вставить("КартинкаСтруктура",	Неопределено);
	ДанныеСтруктура.Вставить("Тело", 				Новый Массив);
	
	Возврат ДанныеСтруктура;

КонецФункции // ПолучитьСтруктуруСправочникаПроизведения()

Функция ПолучитьСтруктуруСправочникаКартинка() Экспорт

	ДанныеСтруктура = Новый Структура;
	
	ДанныеСтруктура.Вставить("Description", 		"");
	ДанныеСтруктура.Вставить("DeletionMark", 		Ложь);
	ДанныеСтруктура.Вставить("Данные",				Неопределено);
	ДанныеСтруктура.Вставить("ДатаЗагрузки",		'00010101010101');
	ДанныеСтруктура.Вставить("Коммент",				"");
	
	Возврат ДанныеСтруктура;

КонецФункции // ПолучитьСтруктуруСправочникаКартинка()

Функция ЗаменитьНеВалидныеСимволыВСтроке(РабочаяСтрока) Экспорт
	
	ВыходнаяСтрока		= РабочаяСтрока;
	НевалидныеСимволы 	= Новый Массив;
	
	НевалидныеСимволы.Добавить("`");
	НевалидныеСимволы.Добавить(",");
	НевалидныеСимволы.Добавить(".");
	НевалидныеСимволы.Добавить("!");
	НевалидныеСимволы.Добавить("""");
	НевалидныеСимволы.Добавить("@");
	НевалидныеСимволы.Добавить("#");
	НевалидныеСимволы.Добавить("№");
	НевалидныеСимволы.Добавить("$");
	НевалидныеСимволы.Добавить(";");
	НевалидныеСимволы.Добавить("%");
	НевалидныеСимволы.Добавить("^");
	НевалидныеСимволы.Добавить(":");
	НевалидныеСимволы.Добавить("&");
	НевалидныеСимволы.Добавить("?");
	НевалидныеСимволы.Добавить("*");
	НевалидныеСимволы.Добавить("(");
	НевалидныеСимволы.Добавить(")");
	НевалидныеСимволы.Добавить("-");
	НевалидныеСимволы.Добавить("_");	
	НевалидныеСимволы.Добавить("=");
	НевалидныеСимволы.Добавить("+");
	НевалидныеСимволы.Добавить("/");
	НевалидныеСимволы.Добавить("*");
	НевалидныеСимволы.Добавить("}");
	НевалидныеСимволы.Добавить("{");
	НевалидныеСимволы.Добавить("[");
	НевалидныеСимволы.Добавить("]");
	НевалидныеСимволы.Добавить("'");
	НевалидныеСимволы.Добавить("<");
	НевалидныеСимволы.Добавить(">");
	НевалидныеСимволы.Добавить("|");
	НевалидныеСимволы.Добавить(" ");
	
	Выборка = РегистрыСведений.НевалидныеСимволыСлов.Выбрать();
	Пока Выборка.Следующий() Цикл
		НевалидныеСимволы.Добавить(Выборка.Символ);	
	КонецЦикла;	
	
	Для каждого НеВалидныйСимвол Из НевалидныеСимволы Цикл	
		ВыходнаяСтрока = СтрЗаменить(ВыходнаяСтрока, НеВалидныйСимвол, "");	
	КонецЦикла;
	
	Возврат ВыходнаяСтрока;

КонецФункции // ПолучитьСтруктуруСправочникаКартинка()
